Repository: futtta/ao_critcss_aas
Catalog: languages/autoptimize-*.po
Languages: pt_br

source: You can create <span class="badge manual">MANUAL</span> rules for specific page paths (URL). Longer, more specific paths have higher priority over shorter ones, which in turn have higher priority over <span class="badge auto">AUTO</span> rules. Also, critical CSS files from <span class="badge manual">MANUAL</span> <strong>rules are NEVER updated automatically.</strong>
pt_br: Você pode criar regras do tipo <span class="badge manual">MANUAL</span> para caminhos específicos (URL). Quanto mais específico o caminho, maior a prioridade da regra, que por sua vez têm mais prioridade do que regras <span class="badge auto">AUTO</span>. O CSS crítico de regras do tipo <span class="badge auto">MANUAL</span> <strong>NUNCA são atualizados automaticamente.</strong>

source: You can also create an <span class="badge auto">AUTO</span> rule for a path by leaving its critical CSS content empty. The critical CSS for that path will be automatically fetched from <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a> for you and updated whenever it changes.
pt_br: Você também pode criar uma regra <span class="badge auto">AUTO</span> deixando seu CSS crítico em branco. O CSS crítico do caminho digitado será obtido automaticamente a partir do <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a> e será atualizado sempre que for alterado.

source: If you see an <span class='badge auto'>AUTO</span> rule with a <span class='badge review'>R</span> besides it (R is after REVIEW), it means that the fetched critical CSS for that rule is not 100% garanteed to work according to <a href='https://criticalcss.com/?aff=1' target='_blank'>criticalcss.com</a> analysis. It's advised that you edit and review that rule to make any required adjustments.
pt_br: Se você ver uma regra <span class='badge auto'>AUTO</span> com um <span class='badge review'>R</span> ao lado dela, significa que o CSS crítico obtido para ela não tem 100% de garantia que irá funcionar bem de acordo com a análise feita pelo <a href='https://criticalcss.com/?aff=1' target='_blank'>criticalcss.com</a>. Recomendamos que você edite e revise a regra e faça os ajustes necessários.

source: At any time you can delete an <span class="badge auto">AUTO</span> or <span class="badge manual">MANUAL</span> rule by cliking on "Remove" button of the desired rule and saving your changes.
pt_br: A qualquer momento você pode apagar regras <span class="badge auto">AUTO</span> ou <span class="badge manual">MANUAL</span> clicando no botão "Remover" da regra desejada e salvando as mudanças.

source: Add New Rule
pt_br: Adicionar Nova Regra

source: Edit Default Rule CSS
pt_br: Editar CSS da Regra Padrão

source: Add CSS To All Rules
pt_br: Adicionar CSS a Todas as Regras

source: Valid
pt_br: Válida

source: Invalid
pt_br: Inválida

source: Your API key is invalid. Please enter a valid <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a> key.
pt_br: Sua chave da API é inválida. Por favor, digite uma chave do <a href="https://criticalcss.com//?aff=1" target="_blank">criticalcss.com</a> válida.

source: Please enter a valid <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a> API key to start.
pt_br: Por favor, digite uma chave do <a href="https://criticalcss.com//?aff=1" target="_blank">criticalcss.com</a> válida para começar.

source: Autoptimize CriticalCSS.com Power-Up Queue
pt_br: Fila do Autoptimize CriticalCSS.com Power-Up

source: Let Autoptimize and CriticalCSS unleash your site performance and make it appear better than anyone in search results.
pt_br: Deixe o Autoptimize e o CriticalCSS libertarem a performance do seu site para fazê-lo aparecer melhor que qualquer um nos resultados de pesquisas.
