Repository: futtta/ao_critcss_aas
Catalog: languages/autoptimize-*.po
Languages: pt_br

source: Autoptimize Power-Up: CriticalCSS requires <a href="https://wordpress.org/plugins/autoptimize/" target="_blank">Autoptimize</a> to be installed and active.
pt_br: O Autoptimize Power-Up: CriticalCSS requer o <a href="https://wordpress.org/plugins/autoptimize/" target="_blank">Autoptimize</a> instalado e ativo.

source: Autoptimize Settings: CriticalCSS Power-Up
pt_br: Configurações do Autoptimize: CriticalCSS Power-Up

source: Could not create the required directory. Make sure the webserver can write to the wp-content directory.
pt_br: Não foi possível criar o diretório. Certifique-se de que o servidor web pode escrever no diretório wp-content.

source: Oops! Please install and activate Autoptimize first.
pt_br: Opa! Primeiro instale e ative o Autoptimize.

source: Oops! Please <strong>activate the "Inline and Defer CSS" option</strong> on Autoptimize's main settings page to use this power-up.
pt_br: Opa! <strong>Ative a opção "Inline and Defer CSS"</strong> na página de configurações principais do Autoptimize para usar esta extensão.

source: Oops! It looks you need to upgrade to Autoptimize 2.2.0 or higher to use this CriticCSS Power-Up.
pt_br: Opa! Parece que você precisa atualizar o Autoptimize para a versão 2.2.0 ou superior para usar esta extensão.

source: Save Changes
pt_br: Salvar Mudanças

source: Export Settings
pt_br: Exportar Configurações

source: Import Settings
pt_br: Importar Configurações

source: Advanced Settings
pt_br: Avançado

source: Viewport Size
pt_br: Tamanho da Área Visível

source: Width
pt_br: Largura

source: Height
pt_br: Altura

source: <a href="https://criticalcss.com/account/api-keys?aff=1" target="_blank">criticalcss.com</a> default viewport size is 1300x900 pixels (width x height). You can change this size by typing a desired width and height values above. Allowed value ranges are from 800 to 4096 for width and from 600 to 2160 for height.
pt_br: O tamanho padrão da área visível no <a href="https://criticalcss.com/account/api-keys?aff=1" target="_blank">criticalcss.com</a> é 1300x900 pixels. Você pode alterar este tamanho digitando acima a largura e altura desejada. Os valores permitidos são de 800 a 4096 para a largura e de 600 a 2160 para a altura.

source: Force Include
pt_br: Forçar Inclusão

source: Force include can be used to style dynamic content that is not part of the HTML that is seen during the Critical CSS generation. To use this feature, add comma separated values with both simple strings and/or regular expressions to match the desired selectors. Regular expressions must be preceeded by two forward slashes. For instance: <code>.button-special,//#footer</code>. In this example <code>.button-special</code> will match <code>.button-special</code> selector only, while <code>//#footer</code> will match <code>#footer</code>, <code>#footer-address</code> and <code>#footer-phone</code> selectors in case they exist.
pt_br: Você pode forçar a inclusão de estilos em conteúdo dinâmicos que não são parte do HTML como ele é visto durante a geração do CSS Crítico. Para usar este recurso, adicione valores separados por vírgula com texto simples e/ou expressão regulares dos seletores desejados. Expressões regulares devem ser precedidas de duas barras. Por exemplo: <code>.button-special,//#footer</code>. Neste exemplo, <code>.button-special</code> incluirá apenas o seletor <code>.button-special</code>, enquanto <code>//#footer</code> incluirá os seletores <code>#footer</code>, <code>#footer-address</code> e <code>#footer-phone</code>, caso eles existam.

source: Request Limit
pt_br: Limite de Requisições

source: Certain hosting services imposes hard limitations to background processes on either execution time, requests made from your server to any third party services, or both. This could lead to a faulty operation of the queue background process triggered by WP-Cron. If automated rules are not being created, you may be facing this limitation from your hosting provider. In that case, set the request limit to a reasonable number between 1 and 240. The queue fire a request to <a href="https://criticalcss.com/account/api-keys?aff=1" target="_blank">criticalcss.com</a> on every 15 seconds (due to service limitations). If your hosting provider allows a 60 seconds time span to background processes runtime, set this value to 3 or 4 so the queue can operate within the boundaries. The maximum value of 240 allows enough requests for one hour long. To disable this limit and to let requests be made at will, just delete any values in this setting (a grey 0 will show).
pt_br: Certos provedores impõem limitações ao tempo de execução ou número de requisições feitas a partir de seus servidores, ou ambas. Isto pode levar a problemas na operação da fila disparada pelo WP-Cron. Se suas regras automáticas não estão sendo criadas, você pode estar enfrentando estas limitações impostas pelo seu provedor. Neste caso, defina o limite de requisições para um número razoável entre 1 e 240. A fila dispara uma requisição para o <a href="https://criticalcss.com/account/api-keys?aff=1" target="_blank">criticalcss.com</a> a cada 15 segundos (por causa de limitações do serviço). Se o seu provedor permite que processos de fundo rodem por 60 segundos, defina este valor para 3 ou 4 para que a fila opere dentro dos limites. O valor máximo de 240 disponibiliza requisições para até uma hora. Para desativar este limite e permitir que as requisições sejam feitas a vontade, apenas apague qualquer valor nesta configuração (um 0 cinza será mostrado).

source: Fetch Original CSS
pt_br: Obtém CSS Original

source: In some (rare) cases the extraction of critical CSS works better with the original CSS instead of the Autoptimized one, this option enables that behavior.
pt_br: Em alguns (raros) casos, a extração do CSS Crítico funciona melhor com o CSS original ao invés do gerado pelo Autopimize. Esta opção habilita este comportamento.

source: Debug Mode
pt_br: Modo de Depuração

source: <strong>CAUTION! DO NOT use debug mode on production/live environments.</strong><br />Check the box above to enable Autoptimize CriticalCSS Power-Up debug mode. It provides debug facilities in this screen, to the browser console and to this file:
pt_br: <strong>Cuidado! NÃO USE o modo de depuração em ambiente de produção.</strong><br />Marque a caixa acima para habilitar o modo de depuração do Autoptimize CriticalCSS Power-Up. Ele provê métodos de depuração nesta tela, no console do navegador e para este arquivo:

source: Debug Information
pt_br: Informação de Debug

source: Options
pt_br: Opções

source: WP-Cron Intervals
pt_br: Intervalos do WP-Cron

source: WP-Cron Scheduled Events
pt_br: Eventos Agendados do WP-Cron

source: Congratulations!
pt_br: Parabéns!

source: You have downloaded, installed and activated the Autoptimize Criticalcss.com Power-Up succesfully!
pt_br: Você baixou, instalou e ativou o Autoptimize CriticalCSS.com Power-Up com sucesso!

source: You're
pt_br: Você está

source: almost ready
pt_br: quase pronto

source: to have your critical CSS generated automatically and
pt_br: para ter seus CSS críticos gerados automaticamente e

source: improve customer experience significantly.
pt_br: melhorar a experiência dos seus clientes significativamente.

source: The next step is to sign up at
pt_br: O próximo passo é assinar o

source: and get the API key, which you can copy from
pt_br: para obter a chave de API que você poderá copiar da

source: the API-keys page
pt_br: página API-keys

source: and paste below.
pt_br: para colar abaixo.

source: If you have any questions or need support, head on over to
pt_br: Se você tiver dúvidas ou precisar de suporte, acesse

source: our support forum
pt_br: nosso fórum

source: and we'll help you get up and running in no time!
pt_br: e nós vamos ajudá-lo bem rápido.

source: Need help? <a href="https://wordpress.org/plugins/autoptimize/faq/">Check out the FAQ here</a>.
pt_br: Precisa de ajuda? Leia o FAQ aqui.

source: Happy with Autoptimize?
pt_br: Feliz com o Autoptimize?

source: Try my other plugins!
pt_br: Teste meus outros plugins!

source: futtta about
pt_br: Sobre o futta

source: Web Technology
pt_br: Tecnologia Web

source: Do not donate for this plugin!
pt_br: Não doe para este plugin!

source: No items
pt_br: Nada aqui

source: Posted %s
pt_br: Publicado %s

source: API Key
pt_br: Chave de API

source: Your API Key
pt_br: Sua Chave de API

source: Please enter your criticalcss.com API key here...
pt_br: Digite sua chave de API do criticalcss.com aqui...

source: Enter your <a href="https://criticalcss.com/account/api-keys?aff=1" target="_blank">criticalcss.com</a> API key above. The key is revalidated every time a new job is sent to it.<br />To obtain your API key, go to <a href="https://criticalcss.com/account/api-keys?aff=1" target="_blank">criticalcss.com</a> > Account > API Keys.<br />Requests to generate a critical CSS via the API are priced at £5 per domain per month.<br /><strong>Not sure yet? With the <a href="https://criticalcss.com/faq/#trial?aff=1" target="_blank">30 day free trial</a>, you have nothing to lose!</strong>
pt_br: Digite acima a sua chave de API do <a href="https://criticalcss.com/account/api-keys?aff=1" target="_blank">criticalcss.com</a>. A chave é revalidada toda vez que um novo job é criado lá.<br />Para obter sua chave de API, vá em <a href="https://criticalcss.com/account/api-keys?aff=1" "target="_blank">criticalcss.com</a> > Account > API Keys.<br /><strong>Requisições para gerar um CSS crítico via API tem preço de £5 (cinco libras esterlinas) por domínio, por mês.</strong><br /><strong>Ainda não tem certeza? Com o <a href="https://criticalcss.com/faq/#trial?aff=1" target="_blank">teste gratuito de 30 dias</a> você não tem nada a perder!</strong>

source: NEW
pt_br: NOVO

source: None
pt_br: Nenhum

source: PENDING
pt_br: PENDENTE

source: REVIEW
pt_br: REVISAR

source: Info from criticalcss.com:
pt_br: Informações do criticalcss.com:

source: - Status:
pt_br: - Estado:

source: - Result:
pt_br: - Resultado

source: - Validation:
pt_br: - Validação:

source: Delete Job
pt_br: Apagar Job

source: DONE
pt_br: PRONTO

source: ERROR
pt_br: ERRO

source: Retry Job
pt_br: Reenviar Job

source: Get Help
pt_br: Obter Ajuda

source: UNKNOWN
pt_br: DESCONHECIDO

source: N/A
pt_br: N/D

source: Job status is
pt_br: Estado do job é

source: Delete
pt_br: Apagar

source: Cancel
pt_br: Cancelar

source: Retry
pt_br: Reenviar

source: Job Queue
pt_br: Fila de Trabalhos

source: Are you sure you want to retry this job?
pt_br: Você tem certeza que deseja reenviar este job?

source: Are you sure you want to delete this job?
pt_br: Você tem certeza que deseja apagar este job?

source: How To Use Autoptimize CriticalCSS Power-Up Queue
pt_br: Como usar a fila de trabalhos do Autoptimize CriticalCSS Power-Up

source: Click the side arrow to toggle instructions
pt_br: Clique na seta ao lado para mostrar/esconder as instruções

source: TL;DR:<br /><strong>Queue runs every 10 minutes.</strong> Job statuses are <span class="badge new">N</span> for NEW, <span class="badge pending">P</span> for PENDING, <span class="badge error">E</span> for ERROR and <span class="badge unknown">U</span> for UNKOWN.
pt_br: TL;DR:<br /><strong>A fila roda a cada 10 minutos</strong> Os status dos jobs (trabalhos) são <span class="badge new">N</span> para NOVO (New), <span class="badge pending">P</span> para PENDENTE (Pending), <span class="badge error">E</span> para ERRO (Error) e <span class="badge unknown">U</span> for DESCONHECIDO (Unknown).

source: The queue operates <strong>automatically, asynchronously and on regular intervals of 10 minutes.</strong> To view updated queue status, refresh this page.
pt_br: A fila roda <strong>automaticamente e de modo assíncrono em intervalos regulares de 10 minutos.</strong> Para ver o estado atualizado da fila, recarregue esta página.

source: When the conditions to create a job are met (i.e. user not logged in, no matching <span class="badge manual">MANUAL</span> rule or CSS files has changed for an <span class="badge auto">AUTO</span> rule), a <span class="badge new">N</span> job is created in the queue.
pt_br: Quando as condições para criar um job existem (usuário não está logado, nenhuma regra <span class="badge manual">MANUAL</span> que combine ou o CSS de uma regra <span class="badge auto">AUTO</span> foi alterado), um job <span class="badge new">N</span> é criado na fila.

source: Autoptimize CriticalCSS Power-Up constantly query the queue for <span class='badge new'>N</span> jobs. When it finds one, gears spins and jobs becomes <span class='badge pending'>P</span> while they are running and <a href='https://criticalcss.com/?aff=1' target='_blank'>criticalcss.com</a> doesn't return a result.
pt_br: O Autoptimize CriticalCSS Power-Up procura na fila os jobs com estado <span class='badge new'>N</span>. Quando os encontra, ela os executa e eles passam a ter o estado <span class='badge pending'>P</span> enquanto o <a href='https://criticalcss.com/api-keys?aff=1' target='_blank'>criticalcss.com</a> não retorna um resultado.

source: As soon as <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a> returns a valid critical CSS file, the job is then finished and removed from the queue.
pt_br: Assim que o <a href="https://criticalcss.com/api-keys?aff=1" target="_blank">criticalcss.com</a> retorna um CSS crítico válido, o job é finalizado e removido da fila.

source: When things go wrong, a job is marked as <span class="badge error">E</span>. You can retry faulty jobs, delete them or get in touch with <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a> for assistance.
pt_br: Quando as coisas dão errado, o job é marcado como <span class="badge error">E</span>. Você pode reenviar jobs neste estado ou entrar em contado com o <a href="https://criticalcss.com/api-keys?aff=1" target="_blank">criticalcss.com</a> para obter ajuda.

source: Sometimes an unknown condition can happen. In this case, the job status becomes <span class="badge unknown">U</span> and you may want to ask <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a> for help or just delete it.
pt_br: As vezes uma condição desconhecida pode ocorrer. Neste caso o estado do job torna-se <span class="badge unknown">U</span> e você pode pedir ajuda ao a href="https://criticalcss.com/api-keys?aff=1" target="_blank">criticalcss.com</a> ou apenas apagar o job neste estado.

source: To get more information about jobs statuses, specially the ones with <span class="badge error">E</span> and <span class="badge unknown">U</span> status, hover your mouse in the status badge of that job. This information might be crucial when contacting <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a> for assistance.
pt_br: Para obter mais informações sobre os estados dos jobs, especialmente aqueles cujo estado são <span class="badge error">E</span> e <span class="badge unknown">U</span>, deixe o mouse sobre o rótulo do estado. Esta informação pode ser crucial para pedir ajuda ao <a href="https://criticalcss.com/api-keys?aff=1" target="_blank">criticalcss.com</a>.

source: <strong>A WORD ABOUT WORDPRESS CRON:</strong> Autoptimize CriticalCSS Power-Up watch the queue by using WordPress Cron (or WP-Cron for short.) It <a href="https://www.smashingmagazine.com/2013/10/schedule-events-using-wordpress-cron/#limitations-of-wordpress-cron-and-solutions-to-fix-em" target="_blank">could be faulty</a> on very light or very heavy loads. If your site receives just a few or thousands visits a day, it might be a good idea to <a href="https://developer.wordpress.org/plugins/cron/hooking-into-the-system-task-scheduler/" target="_blank">turn WP-Cron off and use your system task scheduler</a> to fire it instead.
pt_br: <strong>SOBRE O CRON DO WORDPRESS:</strong> o Autoptimize CriticalCSS Power-Up monitora a fila através do Cron do Wordpress (também chamado de WP-Cron). Ele <a href="https://www.smashingmagazine.com/2013/10/schedule-events-using-wordpress-cron/#limitations-of-wordpress-cron-and-solutions-to-fix-em" target="_blank">pode falhar</a> em cargas muito baixas ou muito altas. Se seu site recebe apenas algumas visitas por dia, pode ser uma boa ideia a href="https://developer.wordpress.org/plugins/cron/hooking-into-the-system-task-scheduler/" target="_blank">desligar o WP-Cron e usar o agendador de eventos do seu sistema</a> para rodar executá-lo.

source: Status
pt_br: Estado

source: Target Rule
pt_br: Regra

source: Page Path
pt_br: Caminho da Página

source: Page Type
pt_br: Tipo da Página

source: Creation Date
pt_br: Criado Em

source: Finish Date
pt_br: Finalizado Em

source: Actions
pt_br: Ações

source: Path Based Rules
pt_br: Regras Baseadas em Caminho

source: Conditional Tags, Custom Post Types and Page Templates Rules
pt_br: Regras para Tags Condicionais, Tipos de Posts Personalizados e Templates

source: Type
pt_br: Tipo

source: Target
pt_br: Alvo

source: Critical CSS File
pt_br: Arquivo de CSS Crítico

source: To be fetched from criticalcss.com in the next queue run...
pt_br: Será obtido do criticalcss.com...

source: Edit
pt_br: Editar

source: Remove
pt_br: Remover

source: Edit Critical CSS Rule
pt_br: Editar Regra

source: Loading critical CSS...
pt_br: Carregando CSS crítico

source: Add Critical CSS Rule
pt_br: Adicionar Regra

source: For type based rules, paste your specific and minified critical CSS here and hit submit to save.
pt_br: Para regras baseadas em tipos, cole o CSS crítico específico e já minificado aqui e clique em enviar.

source: For path based rules, paste your specific and minified critical CSS here or leave this empty to fetch it from criticalcss.com and hit submit to save.
pt_br: Para regras baseadas em caminhos, cole o CSS crítico específico e já minificado aqui ou deixe este campo vazio para obtê-lo do criticalcss.com e clique em enviar.

source: Submit
pt_br: Enviar

source: RULE VALIDATION ERROR!\n\nBased on your rule type, you SHOULD set a path or conditional tag.
pt_br: ERRO DE VALIDAÇÃO DA REGRA!\n\nBaseado no tipo da regra, você DEVE escolher um caminho ou uma tag condicional.

source: RULE VALIDATION ERROR!\n\nType based rules REQUIRES a minified critical CSS.
pt_br: ERRO DE VALIDAÇÃO DA REGRA!\n\nrRegras baseadas em tipos REQUEREM um CSS crítico minificado.

source: Default Critical CSS
pt_br: CSS Crítico Padrão

source: Additional Critical CSS
pt_br: CSS Crítico Adicional

source: Rules
pt_br: Regras

source: <strong>RULES OR QUEUE CHANGED!</strong> Don't forget to save your changes!
pt_br: <strong>REGRA OU FILA ALTERADAS!</strong> Não esqueça de salvar as mudanças.

source: Rule Type
pt_br: Tipo de Regra

source: Path
pt_br: Caminho

source: Conditional Tag
pt_br: Tag Condicional

source: String in Path
pt_br: Texto no Caminho

source: Enter a part of the URL that identifies the page(s) you're targetting.
pt_br: Digite uma parte da URL que identifica a(s) página(s) que você deseja.

source: Conditional Tag, Custom Post Type or Page Template
pt_br: Tags Condicionais, Tipos de Posts ou Templates

source: Select from the list below...
pt_br: Selecione Nesta Lista...

source: Standard Conditional Tags
pt_br: Tags Condicionais Padrão

source: Custom Post Types
pt_br: Tipos de Post

source: Page Templates
pt_br: Templates

source: BBPress Conditional Tags
pt_br: BBPress

source: BuddyPress Conditional Tags
pt_br: BuddyPress

source: Easy Digital Downloads Conditional Tags
pt_br: Easy Digital Downloads

source: WooCommerce Conditional Tags
pt_br: WooCommerce

source: Custom Critical CSS
pt_br: CSS Crítico

source: Paste your specific critical CSS here and hit submit to save.
pt_br: Cole o CSS crítico aqui e envie para salvar.

source: Delete Rule
pt_br: Apagar Regra

source: This Critical CSS rule will be deleted immediately and cannot be recovered.<br /><br /><strong>Are you sure?</strong>
pt_br: Estra regra será apagada imediatamente e não poderá ser recuperada.<br /><br /><strong>Tem certeza que quer apagá-la?</strong>

source: Paste your MINIFIED default critical CSS here and hit submit to save. This is the critical CSS to be used for every page NOT MATCHING any rule.
pt_br: Cole o CSS crítico padrão já MIFICADO aqui e clique em enviar para salvar. Este é o CSS crítico que será usado em cada página que NÃO COMBINA com nenhuma regra.

source: Paste your MINIFIED additional critical CSS here and hit submit to save. This is the CSS to be added AT THE END of every critical CSS provided by a matching rule, or the default one.
pt_br: Cole o CSS crítico adicional já MINIFICADO aqui e clique em enviar para salvar. Este é o CSS crítico que será adicionado AO FINAL de cada CSS crítico fornecido por uma regra, ou do padrão.

source: How To Use Autoptimize CriticalCSS Power-Up Rules
pt_br: Como Usar as Regras do Autoptimize CriticalCSS Power-Up

source: TL;DR:<br />Critical CSS files from <span class='badge auto'>AUTO</span> <strong>rules are updated automatically</strong> while from <span class='badge manual'>MANUAL</span> <strong>rules are not.</strong>
pt_br: Arquivos de CSS crítico de uma regra <span class='badge auto'>AUTO</span> são atualizados automaticamente</strong> enquanto os de uma regra <span class='badge manual'>MANUAL</span> <strong>não são.</strong>

source: When a valid <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a> API key is in place, Autoptimize CriticalCSS Power-Up starts to operate <strong>automatically</strong>.
pt_br: Quando uma chave de API do <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a>, o Autoptimize CriticalCSS Power-Up começa a funcionar <strong>automaticamente</strong>.

source: Upon a request to any of the frontend pages made by a <strong>not logged in user</strong>, it will <strong>asynchronously</strong> fetch and update the critical CSS from <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a> for conditional tags you have on your site (e.g. is_page, is_single, is_archive etc.)
pt_br: Quando um requisição é feita em qualquer uma das páginas do frontend por um <strong>usuário que não esta logado</strong>, ele irá obter e atualizar <strong>de modo assíncrono</strong> o CSS crítico a partir do <a href="https://criticalcss.com/?aff=1" target="_blank">criticalcss.com</a> para as tags condicionais que você tiver em seu site (por exemplo: is_page, is_single, is_archive etc).

source: These requests also creates an <span class="badge auto">AUTO</span> rule for you. The critical CSS files from <span class="badge auto">AUTO</span> <strong>rules are updated automatically</strong> when a CSS file in your theme or frontend plugins changes.
pt_br: Essas requisições também criam uma regra <span class="badge auto">AUTO</span> para você. O CSS crítico de uma regra <span class="badge auto">AUTO</span> <strong>são atualizados automaticamente</strong> quando um CSS do seu tema ou plugins de frontend forem alterados.

source: If you want to make any fine tunning in the critical CSS file of an <span class="badge auto">AUTO</span> rule, click on "Edit" button of that rule, change what you need, submit and save it. The rule you've just edited becomes a <span class="badge manual">MANUAL</span> rule then.
pt_br: Se você quiser fazer ajustes no CSS crítico de uma regra <span class="badge auto">AUTO</span>, clique em "Editar" da regra desejada, altera o que quiser, envie e salve as mudanças. A regra que você acabou de editar torna-se então uma regra <span class="badge manual">MANUAL</span>.
